<template>
  <div class="mx-auto my-7 max-w-[320px] rounded-3xl border border-gray-300 p-4 sm:max-w-[767px]">
    <h1 class="mt-6 text-center text-4xl font-bold">О нас</h1>
    <div class="mx-auto mt-2 max-w-[320px] pb-20 sm:max-w-[767px]">
      <div class="flex justify-center">
        <IconMtuci />
      </div>
      <p class="text-center font-semibold">Команда разработчиков "ЭкоСкан"</p>

      <p class="mt-4">
        Мы — студенты СКФ МТУСИ, создающие приложение для улучшения городской среды Ростова-на-Дону. Наш проект "ЭкоСкан" призван сделать город чище,
        удобнее и комфортнее для всех жителей.
      </p>

      <div class="mt-4">
        <b>Идея проекта:</b> <br />
        В городе ежедневно возникают проблемы, которые мешают его развитию и эстетике:
        <ul class="ml-6 list-disc">
          <li>несанкционированные объявления,</li>
          <li>граффити в неположенных местах,</li>
          <li>разбросанный мусор,</li>
          <li>упавшие деревья или повреждённые дороги,</li>
          <li>и другие нарушения.</li>
        </ul>
      </div>
      <div class="mt-4">
        C "ЭкоСкан" каждый житель может быстро сообщить о проблеме:
        <ul class="ml-6 list-disc">
          <li>Фотографирует нарушение,</li>
          <li>Добавляет описание,</li>
          <li>Отправляет заявку c геолокацией в администрацию.</li>
        </ul>
        После этого ответственные службы получают уведомление и принимают меры.
      </div>
      <div class="mt-4">
        <b>Наша миссия:</b> <br />
        <p class="mt-2">Мы хотим, чтобы Ростов-на-Дону становился лучше с участием самих горожан.</p>
        <p class="mt-2">Наше приложение — это мост между жителями и администрацией, помогающий оперативно решать проблемы.</p>
        <p class="mt-2"><b>Присоединяйтесь!</b> Следите за новостями и помогайте делать город чище и удобнее!</p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import IconMtuci from '@/shared/icons/Mtuci.vue';
</script>
